Revit 2027 API
ACADExportOptions.NonplotSuffix Property
 If the MarkNonplotLayers attribute is set to true, all layers with names containing this suffix will be marked as non-plot. No action will be performed if the suffix is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string NonplotSuffix { get; set; }
Public Property NonplotSuffix As String
	Get
	Set
public:
property String^ NonplotSuffix {
	String^ get ();
	void set (String^ value);
}
member NonplotSuffix : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ACADExportOptions Class
Autodesk.Revit.DB Namespace